#Nolan Kiel
Week14 04/21/2022
Python - Pandas DataFrame - Mapping, Applying

In [1]:
import numpy as np
from pandas import Series,DataFrame
import pandas as pd

In [12]:
# mapping
df = DataFrame({'city':['Alma','Brian Head','Fox Park','Lake Mary'],
                'altitiude':[10355,9800,8966,98850]})
df

         city  altitiude
0        Alma      10355
1  Brian Head       9800
2    Fox Park       8966
3   Lake Mary      98850

In [13]:
st_map={'Alma':'Colorado','Brian Head':'Utah','Fox Park':'Wyoming',
       'Lake Mary':'California'}
st_map

{'Alma': 'Colorado',
 'Brian Head': 'Utah',
 'Fox Park': 'Wyoming',
 'Lake Mary': 'California'}

In [14]:
type(st_map)

dict

In [15]:
df['state']=df['city'].map(st_map)
df

         city  altitiude       state
0        Alma      10355    Colorado
1  Brian Head       9800        Utah
2    Fox Park       8966     Wyoming
3   Lake Mary      98850  California

In [17]:
def meter(x):
    return x / 3.2808

In [18]:
df

         city  altitiude       state
0        Alma      10355    Colorado
1  Brian Head       9800        Utah
2    Fox Park       8966     Wyoming
3   Lake Mary      98850  California

In [ ]:
df['altitude'] = df["altitude"].apply(lambda x: np.nan if x < 2800 else x)
df

In [20]:
df = DataFrame(np.random.randn(4,3), columns=list('bde'),
              index=['UT','OH','TX','OR'])
df

           b         d         e
UT -0.520709  0.463472  0.673405
OH -0.661966  0.112139  1.519920
TX -2.173161 -1.013358  1.743171
OR -1.613356 -1.172095 -0.601228

In [23]:
def dif(x):
    return x.max() - x.min()

In [24]:
df.apply(dif)

b    1.652452
d    1.635567
e    2.344399
dtype: float64

In [25]:
df.apply(dif,axis=1)

UT    1.194114
OH    2.181886
TX    3.916332
OR    1.012128
dtype: float64

In [26]:
df

           b         d         e
UT -0.520709  0.463472  0.673405
OH -0.661966  0.112139  1.519920
TX -2.173161 -1.013358  1.743171
OR -1.613356 -1.172095 -0.601228

In [27]:
df.apply(lambda x: x.max() - x.min())

b    1.652452
d    1.635567
e    2.344399
dtype: float64

In [28]:
df.apply(lambda x: x.max() - x.min(), axis=1)

UT    1.194114
OH    2.181886
TX    3.916332
OR    1.012128
dtype: float64

In [29]:
df.apply(pd.value_counts)

             b    d    e
-2.173161  1.0  NaN  NaN
-1.613356  1.0  NaN  NaN
-1.172095  NaN  1.0  NaN
-1.013358  NaN  1.0  NaN
-0.661966  1.0  NaN  NaN
-0.601228  NaN  NaN  1.0
-0.520709  1.0  NaN  NaN
 0.112139  NaN  1.0  NaN
 0.463472  NaN  1.0  NaN
 0.673405  NaN  NaN  1.0
 1.519920  NaN  NaN  1.0
 1.743171  NaN  NaN  1.0

In [31]:
df.apply(pd.value_counts).fillna(0).astype(int)

           b  d  e
-2.173161  1  0  0
-1.613356  1  0  0
-1.172095  0  1  0
-1.013358  0  1  0
-0.661966  1  0  0
-0.601228  0  0  1
-0.520709  1  0  0
 0.112139  0  1  0
 0.463472  0  1  0
 0.673405  0  0  1
 1.519920  0  0  1
 1.743171  0  0  1

In [36]:
df = DataFrame({'k1': ['a','a','b','b','c'],
                'k2':['one','two','one','two',"one"],
                'dataset1':np.random.randn(5),
                'dataset2':np.random.randn(5)})
df

  k1   k2  dataset1  dataset2
0  a  one  1.140740 -0.329649
1  a  two -0.159385 -1.620230
2  b  one -0.400548  1.364808
3  b  two -0.283799 -0.580438
4  c  one -0.417209  0.707839

In [37]:
df.groupby('k1').mean()

    dataset1  dataset2
k1
a   0.490677 -0.974940
b  -0.342174  0.392185
c  -0.417209  0.707839

In [38]:
df.groupby('k2').mean()

     dataset1  dataset2
k2
one  0.107661  0.580999
two -0.221592 -1.100334

In [39]:
df.groupby('k1').count()

    k2  dataset1  dataset2
k1
a    2         2         2
b    2         2         2
c    1         1         1

In [40]:
df.groupby(['k1','k2']).count()

        dataset1  dataset2
k1 k2
a  one         1         1
   two         1         1
b  one         1         1
   two         1         1
c  one         1         1

In [41]:
df.groupby('k1').size()

k1
a    2
b    2
c    1
dtype: int64

In [42]:
df.groupby('k1').sum()

    dataset1  dataset2
k1
a   0.981355 -1.949879
b  -0.684348  0.784369
c  -0.417209  0.707839

In [43]:
df['dataset1'].groupby(df['k1']).mean()

k1
a    0.490677
b   -0.342174
c   -0.417209
Name: dataset1, dtype: float64

In [44]:
df['dataset1'].groupby(df['k1']).count()

k1
a    2
b    2
c    1
Name: dataset1, dtype: int64

In [45]:
df['dataset1'].groupby(df['k1']).sum()

k1
a    0.981355
b   -0.684348
c   -0.417209
Name: dataset1, dtype: float64

In [46]:
group = df.groupby(['k1','k2'])
group.count()

        dataset1  dataset2
k1 k2
a  one         1         1
   two         1         1
b  one         1         1
   two         1         1
c  one         1         1

In [47]:
group.sum()

        dataset1  dataset2
k1 k2
a  one  1.140740 -0.329649
   two -0.159385 -1.620230
b  one -0.400548  1.364808
   two -0.283799 -0.580438
c  one -0.417209  0.707839

In [48]:
group.mean()

        dataset1  dataset2
k1 k2
a  one  1.140740 -0.329649
   two -0.159385 -1.620230
b  one -0.400548  1.364808
   two -0.283799 -0.580438
c  one -0.417209  0.707839

In [49]:
group.count()

        dataset1  dataset2
k1 k2
a  one         1         1
   two         1         1
b  one         1         1
   two         1         1
c  one         1         1

In [50]:
group.sum()

        dataset1  dataset2
k1 k2
a  one  1.140740 -0.329649
   two -0.159385 -1.620230
b  one -0.400548  1.364808
   two -0.283799 -0.580438
c  one -0.417209  0.707839

In [51]:
group.mean()

        dataset1  dataset2
k1 k2
a  one  1.140740 -0.329649
   two -0.159385 -1.620230
b  one -0.400548  1.364808
   two -0.283799 -0.580438
c  one -0.417209  0.707839

In [52]:
df.groupby(['k1','k2'])[['dataset1']].mean()

        dataset1
k1 k2
a  one  1.140740
   two -0.159385
b  one -0.400548
   two -0.283799
c  one -0.417209

In [53]:
df.groupby(['k1','k2']).mean()

        dataset1  dataset2
k1 k2
a  one  1.140740 -0.329649
   two -0.159385 -1.620230
b  one -0.400548  1.364808
   two -0.283799 -0.580438
c  one -0.417209  0.707839

In [54]:
df.dtypes

k1           object
k2           object
dataset1    float64
dataset2    float64
dtype: object